def thesaurus_adv(*args):
    s_n_sort = {}
    for s_n in args:
        s_n_sort.setdefault(s_n.split()[1][0], {}).setdefault(s_n.split()[0][0], []).append(s_n)
    return s_n_sort


print(thesaurus_adv("Линар Миначев", "Роман Федотов", "Заур Новрузов", "Максим Попов", "Александр Фриман",
                    "Матвей Никольский", "Сергей Минаев", "Расул Эркенов", "Леонид Македонский", "Игорь Петров",
                    "Анатолий Васерман", "Вячеслав Козыдра", "Рустам Ковальчук", "Андрей Масленников",
                    "Олег Радомский"))
